In [1]:
#Creating Databases in MySQL
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="#meKRISH30"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002F4776E07C0>

In [2]:
#cursor for running the MySQL in Python Jupyter Notebook

cursor = mydb.cursor()

In [11]:
#

cursor.execute('SHOW DATABASES')

for database in cursor:
    print(database)

('abc',)
('business',)
('cantilever',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [12]:
# use database

cursor.execute('USE pharm_easy')

In [13]:
# sql_mode=only_full_group_by

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

# JOIN
* A JOIN clause is used to combine rows from two or more tables, based on a related column between them.
### Different Types of SQL JOINs
* (INNER) JOIN: Returns records that have matching values in both tables
* LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
* RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
* FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table
##### INNER JOIN Syntax
* SELECT column_name(s)
* FROM table1
* INNER JOIN table2
* ON table1.column_name = table2.column_name;
##### LEFT JOIN Syntax
* SELECT column_name(s)
* FROM table1
* LEFT JOIN table2
* ON table1.column_name = table2.column_name;
#### RIGHT JOIN Syntax
* SELECT column_name(s)
* FROM table1
* RIGHT JOIN table2
* ON table1.column_name = table2.column_name;
##### FULL OUTER JOIN Syntax
* SELECT column_name(s)
* FROM table1
* FULL OUTER JOIN table2
* ON table1.column_name = table2.column_name
* WHERE condition;

In [14]:
#3.1.1 # INNER JOIN

sql= "SELECT * FROM users as A INNER JOIN follows as B ON A.user_id=B.id"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1102', '2010-04-21 13:35:20')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1105', '2014-07-27 12:35:50')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1110', '2018-01-27 18:15:20')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1115', '2016-07-07 19:45:40')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1116', '2018-04-16 20:05:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1109', '2015-11-19 22:45:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1106', '2013-03-13 23:42:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1103', '2011-09-15 13:22:40')

In [15]:
#3.1.2 #RIGHT JOIN

sql= "SELECT * FROM users as A RIGHT JOIN follows as B ON A.user_id=B.id"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1102', '2010-04-21 13:35:20')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1105', '2014-07-27 12:35:50')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1110', '2018-01-27 18:15:20')
('1101', 'Debabrata', 'Maiti', 'BRAK', '1101', '1115', '2016-07-07 19:45:40')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1116', '2018-04-16 20:05:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1109', '2015-11-19 22:45:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1106', '2013-03-13 23:42:20')
('1102', 'Anil', 'Sethi', 'BRAK', '1102', '1103', '2011-09-15 13:22:40')

In [16]:
#3.1.3 #LEFT JOIN

sql= "SELECT * FROM users as A LEFT JOIN follows as B ON A.user_id=B.user_id"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

ProgrammingError: 1054 (42S22): Unknown column 'B.user_id' in 'on clause'

In [17]:
#3.1.4 FULL OUTER JOIN
"""
sql= "SELECT * FROM users as A FULL JOIN follows as B ON A.user_id=B.id"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x) """

'\nsql= "SELECT * FROM users as A FULL JOIN follows as B ON A.user_id=B.id"\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x) '

In [18]:
#SELF JOIN

#  UNION (join two table colume wise)
* The UNION operator is used to **combine the result-set of two or more SELECT statements**.
** Each SELECT statement within UNION must have the same number of columns
** The columns must also have similar data types
** The columns in each SELECT statement must also be in the same order

#### UNION Syntax-- The UNION operator selects only distinct values by default with sorted.
* SELECT column_name(s) FROM table1
* UNION
* SELECT column_name(s) FROM table2;

#### UNION ALL Syntax-- It allow duplicate values, use UNION ALL:
* SELECT column_name(s) FROM table1
* UNION ALL
* SELECT column_name(s) FROM table2;

##### EXAMPLE
* 1st table -- NAME(s) | AGE(i) | SEX(s)
* 2nd table-- COMP(s) | NUM(i) | ADD(s)

In [19]:
#3.2 #UNION
"""
sql= "SELECT *  FROM customers UNION SELECT * FROM orders "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x) """

'\nsql= "SELECT *  FROM customers UNION SELECT * FROM orders "\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x) '

# EXISTS
* The MySQL EXISTS condition is used in combination with a subquery and is considered "to be met" if the subquery returns at least one row. It can be used in a SELECT, INSERT, UPDATE, or DELETE statement.
* The EXISTS operator is used to test for the existence of any record in a subquery.
* The EXISTS operator returns true if the subquery returns one or more records.
#### EXISTS Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE EXISTS (SELECT column_name FROM table_name WHERE condition);

In [20]:
#3.3 #
"""
sql= "SELECT customerName FROM customers WHERE EXISTS (SELECT OrderDate FROM orders WHERE customers.CustomerID= orders.CustomerID AND ShipperID='4')  "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)
"""

'\nsql= "SELECT customerName FROM customers WHERE EXISTS (SELECT OrderDate FROM orders WHERE customers.CustomerID= orders.CustomerID AND ShipperID=\'4\')  "\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x)\n'

In [21]:
#
"""
sql= "SELECT customerName FROM customers WHERE EXISTS (SELECT OrderDate FROM orders WHERE customers.CustomerID= orders.CustomerID AND ShipperID='4')  "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x) """

'\nsql= "SELECT customerName FROM customers WHERE EXISTS (SELECT OrderDate FROM orders WHERE customers.CustomerID= orders.CustomerID AND ShipperID=\'4\')  "\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x) '

# HAVING- (WHERE with **aggregate** functions)
* WHERE Clause is used to filter the records **from the table** based on the specified condition.
* HAVING Clause is used to filter record **from the groups** based on the specified condition.
* .
* MySQL HAVING Clause is used with GROUP BY clause. It always returns the rows where condition is TRUE.
* The HAVING clause was added to SQL because the WHERE keyword could not be used with **aggregate** functions.
#### HAVING Syntax
* SELECT expression1, expression2, expression_n, aggregate_function (expression)  
* FROM tables  
* [WHERE conditions]  
* GROUP BY expression1, expression2, ... expression_n  
* HAVING condition; 
**Note-** The HAVING clause is only useful when you use it with the GROUP BY clause to generate the output of the high-level reports.

In [22]:
#3.6 #HAVING
# # How many are copyed/repetative and what are those values.

sql= "select a.id,a.name,a.salary,a.dept,a.age from employees as a inner join (select age, count(age) from employees group by age having count(age)>1) as b on a.age=b.age order by age"  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#select A.name,A.salary from employees as A inner join (Select salary from employees group by salary HAVING count(salary)>1)SUB on A.salary=SUB.salary;
#select A.name,A.age from employees as A inner join (Select age from employees group by age HAVING count(age)>1)SUB on A.age=SUB.age ;

('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1416', 'Moinag', '29000', 'Techer', '29')
('1410', 'Samares', '20000', 'Doct', '35')
('1413', 'Tripti', '40000', 'Techer', '35')
('1408', 'Samu', '80000', 'Engineer', '58')
('1415', 'Hedu', '60000', 'Techer', '58')

# ANY 
* The ANY and ALL operators are used with a WHERE or HAVING clause.
* The ANY operator **returns true value if any of the subquery values meet the condition**.
* The ANY operator returns TRUE if the comparison is TRUE for ANY of the values returned by the subquery.
* Where comparison_operator is any of the comparison operator like =, <, >, <=, >=, !=, <>.
#### ANY Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE column_name **comparison_operator** ANY (SELECT column_name FROM table_name WHERE condition);

In [23]:
#3.4 #ANY
"""
sql= "SELECT customerName FROM customers WHERE CustomerID= ANY (SELECT CustomerID FROM orders WHERE  ShipperID='4')  "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x) """

'\nsql= "SELECT customerName FROM customers WHERE CustomerID= ANY (SELECT CustomerID FROM orders WHERE  ShipperID=\'4\')  "\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x) '

# ALL
* The ALL operator **returns true if all of the subquery values meet the condition**.
* Where comparison_operator is any of the comparison operator like =, <, >, <=, >=, !=, <>.
#### ALL Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE column_name **comparison_operator** ALL (SELECT column_name FROM table_name WHERE condition);

# SOME-
SOME compare a value to each value in a list or results from a query and evaluate to true if the result of an inner query contains at least one row. SOME must match at least one row in the subquery and must be preceded by comparison operators. Suppose using greater than ( >) with SOME means greater than at least one value.

#### Syntax:
* SELECT [column_name... | expression1 ]
* FROM [table_name]
* WHERE expression2 **comparison_operator** {ALL | ANY | SOME} ( subquery )

# IN - (multiple OR conditions)
* The IN operator allows you to **specify multiple values in a WHERE clause**.
* The IN operator is a shorthand for multiple OR conditions.
#### IN Syntax
* SELECT column_name(s) 
* FROM table_name 
* WHERE column_name IN (value1, value2, ...);
* ## or
* SELECT column_name(s) 
* FROM table_name 
* WHERE column_name IN (SELECT STATEMENT);

In [24]:
# IN
#3.5 #duplicate age data

sql= "select * from employees where age IN (select age from employees group by age having count(age)>1)"  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1408', 'Samu', '80000', 'Engineer', '58')
('1410', 'Samares', '20000', 'Doct', '35')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1413', 'Tripti', '40000', 'Techer', '35')
('1415', 'Hedu', '60000', 'Techer', '58')
('1416', 'Moinag', '29000', 'Techer', '29')

In [25]:
# NOT IN
#Student's whose age are not 24&26
"""
sql= "SELECT * FROM BT_Dept WHERE age NOT IN (24,26)  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x) """

'\nsql= "SELECT * FROM BT_Dept WHERE age NOT IN (24,26)  "  \ncursor.execute(sql)\nmyresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.\n\nfor x in myresult:\n  print(x) '

In [26]:
#3.7 #

In [28]:
#DATEDIFF-Return days between teo date

#9 #Tell me the time intervel one user connect with another integer-
sql= "select id,follow,date,LastDay,DATEDIFF(LastDay,date) as Diff from (select id,follow,date, LEAD(date,1,'2020-03-04') OVER(PARTITION BY id order by id,date) AS LastDay from follows) SUB"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1101', '1102', '2010-04-21 13:35:20', '2014-07-27 12:35:50', 1558)
('1101', '1105', '2014-07-27 12:35:50', '2016-07-07 19:45:40', 711)
('1101', '1115', '2016-07-07 19:45:40', '2018-01-27 18:15:20', 569)
('1101', '1110', '2018-01-27 18:15:20', '2020-03-04', 767)
('1102', '1103', '2011-09-15 13:22:40', '2013-03-13 23:42:20', 545)
('1102', '1106', '2013-03-13 23:42:20', '2015-11-19 22:45:20', 981)
('1102', '1109', '2015-11-19 22:45:20', '2018-04-16 20:05:20', 879)
('1102', '1116', '2018-04-16 20:05:20', '2020-03-04', 688)

# Window Function

* Window functions operate on a set of rows and return a single value for each row from the underlying query.
* Window functions operate on a set of rows and return a single aggregated value for each row.
#### Diff B/W row_number(), rank(), dense_rank()
* The row_number gives continuous numbers,while rank and dense_rank give the same rank for duplicates, but the next number in rank is as per continuous order so you will see a jump but in dense_rank doesn't have any gap in rankings.

#### In SQL Server we have different categories of window functions
* Aggrigate Function-- AVG, SUM, COUNT, MIN, MAX,
* Ranking Function-- 
** RANK--RANK gives you the ranking within your ordered partition. Ties are assigned the same rank,(Skip is allow)
** DENSE_RANK--gives you the ranking within your ordered partition, but the ranks are consecutive. No ranks are skipped if there are ranks with multiple items.
** ROW_NUMBER--assigns a sequential integer to each row within the partition of a result set.
** CUME_DIST--cumulative distribution
* Analytic Function-- 
** LEAD--fetches data from a subsequent row.
** LAG--fetch data from a previous row,
** FIRST_VALUE--returns the first value in an ordered set of values
** LAST_VALUE--returns the last value in an ordered set of values.
** NTH_VALUE--function returns the value of expression from the Nth row of the window frame. If that Nth row does not exist, the function returns NULL . N must be a positive integer

#### OVER Clause defines the partitioning and ordering of a rows (i.e a window) for the above functions to operate on. Hence these functions are called window functions. The OVER clause accepts the following three arguments to define a window for these functions to operate on.
* ORDER BY : Defines the logical order of the rows
* PARTITION BY : Divides the query result set into partitions. The window function is applied to each partition separately.
* ROWS or RANGE clause : Further limits the rows within the partition by specifying start and end points within the partition.

#### The default for ROWS or RANGE clause is
* RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW

###
* SELECT Name, Gender, Salary, Age 
* -----AVG(Salary) OVER(ORDER BY Salary) AS Average--------------------------># same for (SUM, COUNT, MIN, MAX)
* -----AVG(Salary) OVER(PARTITION BY Salary) AS Average
* -----RANK() OVER(ORDER BY Salary) AS Average-------------------------------># Same for (RANK, DENSE_RANK, ROW_NUMBER)
* -----RANK() OVER(PARTITION BY Salary ORDER BY ___ ) AS Average
* FROM Employees
* GROUP BY ____
* WHERE ______

In [30]:
# -selected database
cursor.execute('use Pharm_easy')

In [31]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('employees',)
('follows',)
('users',)

In [32]:
#ANY

sql= "SELECT * FROM employees  "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1401', 'D Maiti', '140000', 'Prof', '42')
('1402', 'Amit Sethi', '100000', 'Prof', '39')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1405', 'Babu', '60000', 'Engineer', '26')
('1406', 'Bablu', '120000', 'Engineer', '56')
('1407', 'Srinjoy', '80000', 'Engineer', '25')
('1408', 'Samu', '80000', 'Engineer', '58')
('1409', 'Narayan', '50000', 'Doct', '68')
('1410', 'Samares', '20000', 'Doct', '35')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1412', 'Anup', '30000', 'Doct', '32')
('1413', 'Tripti', '40000', 'Techer', '35')
('1414', 'Bratati', '37000', 'Techer', '41')
('1415', 'Hedu', '60000', 'Techer', '58')
('1416', 'Moinag', '29000', 'Techer', '29')

In [33]:
#Rank
#3.4.1 #Rank age wise

sql= "select RANK() OVER(order by age desc) as rnk, id,name,salary,dept,age from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

(1, '1409', 'Narayan', '50000', 'Doct', '68')
(2, '1408', 'Samu', '80000', 'Engineer', '58')
(2, '1415', 'Hedu', '60000', 'Techer', '58')
(4, '1406', 'Bablu', '120000', 'Engineer', '56')
(5, '1401', 'D Maiti', '140000', 'Prof', '42')
(6, '1414', 'Bratati', '37000', 'Techer', '41')
(7, '1402', 'Amit Sethi', '100000', 'Prof', '39')
(8, '1410', 'Samares', '20000', 'Doct', '35')
(8, '1413', 'Tripti', '40000', 'Techer', '35')
(10, '1412', 'Anup', '30000', 'Doct', '32')
(11, '1403', 'Tilak Maiti', '40000', 'Prof', '29')
(11, '1416', 'Moinag', '29000', 'Techer', '29')
(13, '1404', 'Krish Nendu', '70000', 'Prof', '27')
(13, '1411', 'Amitosh', '40000', 'Doct', '27')
(15, '1405', 'Babu', '60000', 'Engineer', '26')
(16, '1407', 'Srinjoy', '80000', 'Engineer', '25')

In [34]:
#DENSE_RANK
#3.4.2 #Dense Rank age wise

sql= " select DENSE_RANK() OVER(order by age desc) as rnk, id,name,salary,dept,age from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

(1, '1409', 'Narayan', '50000', 'Doct', '68')
(2, '1408', 'Samu', '80000', 'Engineer', '58')
(2, '1415', 'Hedu', '60000', 'Techer', '58')
(3, '1406', 'Bablu', '120000', 'Engineer', '56')
(4, '1401', 'D Maiti', '140000', 'Prof', '42')
(5, '1414', 'Bratati', '37000', 'Techer', '41')
(6, '1402', 'Amit Sethi', '100000', 'Prof', '39')
(7, '1410', 'Samares', '20000', 'Doct', '35')
(7, '1413', 'Tripti', '40000', 'Techer', '35')
(8, '1412', 'Anup', '30000', 'Doct', '32')
(9, '1403', 'Tilak Maiti', '40000', 'Prof', '29')
(9, '1416', 'Moinag', '29000', 'Techer', '29')
(10, '1404', 'Krish Nendu', '70000', 'Prof', '27')
(10, '1411', 'Amitosh', '40000', 'Doct', '27')
(11, '1405', 'Babu', '60000', 'Engineer', '26')
(12, '1407', 'Srinjoy', '80000', 'Engineer', '25')

In [35]:
#ROW_NUMBER
#3.4.3 #ROW_NUMBER-top 2 users dept wise

sql= "select ROW_NUMBER() OVER(PARTITION BY dept order by age desc) as rnk, id,name,salary,dept,age from employees"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

(1, '1409', 'Narayan', '50000', 'Doct', '68')
(2, '1410', 'Samares', '20000', 'Doct', '35')
(3, '1412', 'Anup', '30000', 'Doct', '32')
(4, '1411', 'Amitosh', '40000', 'Doct', '27')
(1, '1408', 'Samu', '80000', 'Engineer', '58')
(2, '1406', 'Bablu', '120000', 'Engineer', '56')
(3, '1405', 'Babu', '60000', 'Engineer', '26')
(4, '1407', 'Srinjoy', '80000', 'Engineer', '25')
(1, '1401', 'D Maiti', '140000', 'Prof', '42')
(2, '1402', 'Amit Sethi', '100000', 'Prof', '39')
(3, '1403', 'Tilak Maiti', '40000', 'Prof', '29')
(4, '1404', 'Krish Nendu', '70000', 'Prof', '27')
(1, '1415', 'Hedu', '60000', 'Techer', '58')
(2, '1414', 'Bratati', '37000', 'Techer', '41')
(3, '1413', 'Tripti', '40000', 'Techer', '35')
(4, '1416', 'Moinag', '29000', 'Techer', '29')

In [36]:
#3.4.4 #The CUME_DIST() is a window function that returns the cumulative distribution of a value within a 
#set of values.
#It represents the number of rows with values less than or equal to that row’s value divided by the total number 
#of rows.(0-to-1)


sql= " select CUME_DIST() OVER(order by age desc) as rnk, id,name,salary,dept,age from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

(0.0625, '1409', 'Narayan', '50000', 'Doct', '68')
(0.1875, '1408', 'Samu', '80000', 'Engineer', '58')
(0.1875, '1415', 'Hedu', '60000', 'Techer', '58')
(0.25, '1406', 'Bablu', '120000', 'Engineer', '56')
(0.3125, '1401', 'D Maiti', '140000', 'Prof', '42')
(0.375, '1414', 'Bratati', '37000', 'Techer', '41')
(0.4375, '1402', 'Amit Sethi', '100000', 'Prof', '39')
(0.5625, '1410', 'Samares', '20000', 'Doct', '35')
(0.5625, '1413', 'Tripti', '40000', 'Techer', '35')
(0.625, '1412', 'Anup', '30000', 'Doct', '32')
(0.75, '1403', 'Tilak Maiti', '40000', 'Prof', '29')
(0.75, '1416', 'Moinag', '29000', 'Techer', '29')
(0.875, '1404', 'Krish Nendu', '70000', 'Prof', '27')
(0.875, '1411', 'Amitosh', '40000', 'Doct', '27')
(0.9375, '1405', 'Babu', '60000', 'Engineer', '26')
(1.0, '1407', 'Srinjoy', '80000', 'Engineer', '25')

In [37]:
#Cumulative_Sum
# Cumulative Age dept wise.

sql= "select id, name,salary,dept,age,sum(age) over(partition by dept order by age) as comulative from employees;"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1411', 'Amitosh', '40000', 'Doct', '27', 27.0)
('1412', 'Anup', '30000', 'Doct', '32', 59.0)
('1410', 'Samares', '20000', 'Doct', '35', 94.0)
('1409', 'Narayan', '50000', 'Doct', '68', 162.0)
('1407', 'Srinjoy', '80000', 'Engineer', '25', 25.0)
('1405', 'Babu', '60000', 'Engineer', '26', 51.0)
('1406', 'Bablu', '120000', 'Engineer', '56', 107.0)
('1408', 'Samu', '80000', 'Engineer', '58', 165.0)
('1404', 'Krish Nendu', '70000', 'Prof', '27', 27.0)
('1403', 'Tilak Maiti', '40000', 'Prof', '29', 56.0)
('1402', 'Amit Sethi', '100000', 'Prof', '39', 95.0)
('1401', 'D Maiti', '140000', 'Prof', '42', 137.0)
('1416', 'Moinag', '29000', 'Techer', '29', 29.0)
('1413', 'Tripti', '40000', 'Techer', '35', 64.0)
('1414', 'Bratati', '37000', 'Techer', '41', 105.0)
('1415', 'Hedu', '60000', 'Techer', '58', 163.0)

In [38]:
# Cumulative_Avg
# Cumulative_Avg of Age dept wise.

"""
sql= "  "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x) """

'\nsql= "  "\ncursor.execute(sql)\n\nmyresult = cursor.fetchall()\n\nfor x in myresult:\n  print(x) '

In [39]:
#3.4.5 #The LAG() function is used to get value from row that precedes the current row.
# The LEAD() function is used to get value from row that succedes the current row.

sql= "select user_id,follow,date,LastDay,DATEDIFF(LastDay,date) as Diff from (select user_id,follow,date, LEAD(date,1,'2020-03-04') OVER(PARTITION BY user_id order by user_id,date) AS LastDay from follows) SUB "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

ProgrammingError: 1054 (42S22): Unknown column 'user_id' in 'field list'

In [40]:
#3.4.6 #First_value

sql= "select id,name,salary,dept,age, first_value(name) OVER(partition by dept order by age) as AA from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1411', 'Amitosh', '40000', 'Doct', '27', 'Amitosh')
('1412', 'Anup', '30000', 'Doct', '32', 'Amitosh')
('1410', 'Samares', '20000', 'Doct', '35', 'Amitosh')
('1409', 'Narayan', '50000', 'Doct', '68', 'Amitosh')
('1407', 'Srinjoy', '80000', 'Engineer', '25', 'Srinjoy')
('1405', 'Babu', '60000', 'Engineer', '26', 'Srinjoy')
('1406', 'Bablu', '120000', 'Engineer', '56', 'Srinjoy')
('1408', 'Samu', '80000', 'Engineer', '58', 'Srinjoy')
('1404', 'Krish Nendu', '70000', 'Prof', '27', 'Krish Nendu')
('1403', 'Tilak Maiti', '40000', 'Prof', '29', 'Krish Nendu')
('1402', 'Amit Sethi', '100000', 'Prof', '39', 'Krish Nendu')
('1401', 'D Maiti', '140000', 'Prof', '42', 'Krish Nendu')
('1416', 'Moinag', '29000', 'Techer', '29', 'Moinag')
('1413', 'Tripti', '40000', 'Techer', '35', 'Moinag')
('1414', 'Bratati', '37000', 'Techer', '41', 'Moinag')
('1415', 'Hedu', '60000', 'Techer', '58', 'Moinag')

In [41]:
#3.4.7 #Last Value

sql= " select id,name,salary,dept,age, last_value(name) OVER(partition by dept order by age ) as AA from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

# Wrong

('1411', 'Amitosh', '40000', 'Doct', '27', 'Amitosh')
('1412', 'Anup', '30000', 'Doct', '32', 'Anup')
('1410', 'Samares', '20000', 'Doct', '35', 'Samares')
('1409', 'Narayan', '50000', 'Doct', '68', 'Narayan')
('1407', 'Srinjoy', '80000', 'Engineer', '25', 'Srinjoy')
('1405', 'Babu', '60000', 'Engineer', '26', 'Babu')
('1406', 'Bablu', '120000', 'Engineer', '56', 'Bablu')
('1408', 'Samu', '80000', 'Engineer', '58', 'Samu')
('1404', 'Krish Nendu', '70000', 'Prof', '27', 'Krish Nendu')
('1403', 'Tilak Maiti', '40000', 'Prof', '29', 'Tilak Maiti')
('1402', 'Amit Sethi', '100000', 'Prof', '39', 'Amit Sethi')
('1401', 'D Maiti', '140000', 'Prof', '42', 'D Maiti')
('1416', 'Moinag', '29000', 'Techer', '29', 'Moinag')
('1413', 'Tripti', '40000', 'Techer', '35', 'Tripti')
('1414', 'Bratati', '37000', 'Techer', '41', 'Bratati')
('1415', 'Hedu', '60000', 'Techer', '58', 'Hedu')

In [42]:
#3.4.8 #Last_VAlue

sql= " select id,name,salary,dept,age, last_value(name) OVER(partition by dept order by age ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) as AA from employees "
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

('1411', 'Amitosh', '40000', 'Doct', '27', 'Narayan')
('1412', 'Anup', '30000', 'Doct', '32', 'Narayan')
('1410', 'Samares', '20000', 'Doct', '35', 'Narayan')
('1409', 'Narayan', '50000', 'Doct', '68', 'Narayan')
('1407', 'Srinjoy', '80000', 'Engineer', '25', 'Samu')
('1405', 'Babu', '60000', 'Engineer', '26', 'Samu')
('1406', 'Bablu', '120000', 'Engineer', '56', 'Samu')
('1408', 'Samu', '80000', 'Engineer', '58', 'Samu')
('1404', 'Krish Nendu', '70000', 'Prof', '27', 'D Maiti')
('1403', 'Tilak Maiti', '40000', 'Prof', '29', 'D Maiti')
('1402', 'Amit Sethi', '100000', 'Prof', '39', 'D Maiti')
('1401', 'D Maiti', '140000', 'Prof', '42', 'D Maiti')
('1416', 'Moinag', '29000', 'Techer', '29', 'Hedu')
('1413', 'Tripti', '40000', 'Techer', '35', 'Hedu')
('1414', 'Bratati', '37000', 'Techer', '41', 'Hedu')
('1415', 'Hedu', '60000', 'Techer', '58', 'Hedu')

In [43]:
#3.5 #

#DATEDIFF(LastDay,date)

# Missing value check

In [44]:
# select * from employes where age IS NUL;
# select * from employes where (age <0) AND (age>120);

In [45]:
# Imputting Missing value

In [46]:
#
# select median(age) from employees;